# CurrentRating Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalTransferSwitchData..::..CurrentRating Property
AnalyticalTransferSwitchData Class See Also
---
The current rating value of the electrical analytical transfer switch.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public double CurrentRating { get; set; }
```

Visual Basic
---
```text
Public Property CurrentRating As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CurrentRating {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for rating is not a number -or- When setting this property: The given value for rating is not finite |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for rating must be non-negative. |

# See Also
AnalyticalTransferSwitchData Class
Autodesk.Revit.DB.Electrical Namespace